app/Controllers/Auth/LoginController.php

SELECT *
FROM `users`
WHERE `email` = 'superadmin@peradi.or.id'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function attempt()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[8]',
        ];
        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

UPDATE `users` SET `last_login_at` = '2026-10-06 16:48:24', `last_login_ip` = '::1', `updated_at` = '2026-10-06 16:48:24'
WHERE `users`.`id` IN ('1')
---
        ]);

        // Update last login
        $userModel->update($user['id'], [
            'last_login_at' => date('Y-m-d H:i:s'),
            'last_login_ip' => $this->request->getIPAddress(),
        ]);