app/Controllers/Admin/DashboardController.php

    private function getDataPerCabang(): array
{
    $db = \Config\Database::connect();

    // 1. Ambil semua cabang DPC yang aktif
    $cabangList = $db->table('pbh_cabang')
        ->where('tipe', 'DPC')
        ->where('is_active', 1)
        ->orderBy('nama', 'ASC')
        ->get()->getResultArray();

    $result = [];

    foreach ($cabangList as $cabang) {
        $cabangId = (int) $cabang['id'];

        // Jumlah advokat aktif di cabang ini
        $totalAdvokat = $db->table('users')
            ->where('role', 'advokat')
            ->where('pbh_cabang_id', $cabangId)
            ->where('status', 'aktif')
            ->countAllResults();

        // Pengaduan masuk (semua pengajuan bukan draft)
        $totalMasuk = $db->table('pengajuan')
            ->where('pbh_cabang_id', $cabangId)
            ->where('status !=', 'draft')
            ->countAllResults();

        // Pengaduan sukses (approved)
        $totalSukses = $db->table('pengajuan')
            ->where('pbh_cabang_id', $cabangId)
            ->where('status', 'approved')
            ->countAllResults();
---
SELECT *
FROM `pbh_cabang`
WHERE `tipe` = 'DPC'
AND `is_active` = 1
ORDER BY `nama` ASC
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'advokat'
AND `pbh_cabang_id` = 2
AND `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
WHERE `pbh_cabang_id` = 2
AND `status` != 'draft'
SELECT COUNT(*) AS `numrows`
FROM `pengajuan`
WHERE `pbh_cabang_id` = 2
AND `status` = 'approved'