app/Controllers/Admin/UserManagementController.php

    public function index()
    {
        $filters = [
            'role'      => $this->request->getGet('role'),
            'status'    => $this->request->getGet('status'),
            'cabang_id' => $this->request->getGet('cabang_id'),
            'q'         => $this->request->getGet('q'),
        ];

        $model = model('UserModel');
        $builder = $model->select('users.*, pbh_cabang.nama as cabang_nama')
                         ->join('pbh_cabang', 'pbh_cabang.id = users.pbh_cabang_id', 'left')
                         ->orderBy('users.created_at', 'DESC');

        if (!empty($filters['role']))      $builder->where('users.role', $filters['role']);
        if (!empty($filters['status']))    $builder->where('users.status', $filters['status']);
        if (!empty($filters['cabang_id'])) $builder->where('users.pbh_cabang_id', $filters['cabang_id']);
        if (!empty($filters['q'])) {
            $builder->groupStart()
                ->like('users.nama_lengkap', $filters['q'])
                ->orLike('users.email', $filters['q'])
                ->orLike('users.nia', $filters['q'])
            ->groupEnd();
        }

        $list = $builder->paginate(20);

        return view('admin/user_list', [
            'title'      => 'Manajemen User',
            'list'       => $list,
            'pager'      => $model->pager,
            'filters'    => $filters,
            'cabangList' => model('PbhCabangModel')->where('tipe', 'DPC')->findAll(),
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
LEFT JOIN `pbh_cabang` ON `pbh_cabang`.`id` = `users`.`pbh_cabang_id`
WHERE `users`.`deleted_at` IS NULL
SELECT `users`.*, `pbh_cabang`.`nama` as `cabang_nama`
FROM `users`
LEFT JOIN `pbh_cabang` ON `pbh_cabang`.`id` = `users`.`pbh_cabang_id`
WHERE `users`.`deleted_at` IS NULL
ORDER BY `users`.`created_at` DESC
 LIMIT 20
SELECT *
FROM `pbh_cabang`
WHERE `tipe` = 'DPC'