app/Models/ActivityLogModel.php

SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
WHERE `created_at` < '2026-07-08 16:50:08'
---
    public function countOldLogs(int $days): int
    {
        return $this->where('created_at <', date('Y-m-d H:i:s', strtotime("-{$days} days")))
                    ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
---
    public function countAll(): int
    {
        return $this->countAllResults();

SELECT `activity_logs`.`user_id`, `users`.`nama_lengkap`, `users`.`role`, COUNT(*) as total
FROM `activity_logs`
LEFT JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
WHERE `activity_logs`.`user_id` IS NOT NULL
AND `activity_logs`.`created_at` >= '2026-07-08 16:50:08'
GROUP BY `activity_logs`.`user_id`
ORDER BY `total` DESC
 LIMIT 10
---
    public function chartTopUsers(int $limit = 10, int $days = 90): array
    {
        return $this->select('activity_logs.user_id, users.nama_lengkap, users.role, COUNT(*) as total')
                    ->join('users', 'users.id = activity_logs.user_id', 'left')
                    ->where('activity_logs.user_id IS NOT NULL')
                    ->where('activity_logs.created_at >=', date('Y-m-d H:i:s', strtotime("-{$days} days")))
                    ->groupBy('activity_logs.user_id')
                    ->orderBy('total', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT `action`, COUNT(*) as total
FROM `activity_logs`
WHERE `created_at` >= '2026-07-08 16:50:08'
GROUP BY `action`
ORDER BY `total` DESC
 LIMIT 15
---
    public function chartActionDistribution(int $days = 90): array
    {
        return $this->select('action, COUNT(*) as total')
                    ->where('created_at >=', date('Y-m-d H:i:s', strtotime("-{$days} days")))
                    ->groupBy('action')
                    ->orderBy('total', 'DESC')
                    ->limit(15)
                    ->findAll();

SELECT DATE(created_at) as tanggal, COUNT(*) as total
FROM `activity_logs`
WHERE `created_at` >= '2026-09-06 16:50:08'
GROUP BY DATE(created_at)
ORDER BY `tanggal` ASC
---
    public function chartDaily(int $days = 30): array
    {
        $rows = $this->select('DATE(created_at) as tanggal, COUNT(*) as total')
            ->where('created_at >=', date('Y-m-d H:i:s', strtotime("-{$days} days")))
            ->groupBy('DATE(created_at)')
            ->orderBy('tanggal', 'ASC')
            ->findAll();

SELECT *
FROM `activity_logs`
WHERE `action` = 'login_failed'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function recentFailedLogins(int $limit = 10): array
    {
        return $this->where('action', 'login_failed')
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->findAll();