app/Models/BlockedIpModel.php

    public function isBlocked(string $ip): ?array
    {
        $row = $this->where('ip_address', $ip)
            ->groupStart()
                ->where('expired_at', null)
                ->orWhere('expired_at >=', date('Y-m-d H:i:s'))
            ->groupEnd()
            ->first();
---
SELECT *
FROM `blocked_ips`
WHERE `ip_address` = '::1'
AND   (
`expired_at` IS NULL
OR `expired_at` >= '2026-10-06 16:50:07'
 )
 LIMIT 1