app/Models/IpWhitelistModel.php

    public function isWhitelisted(string $ip): bool
    {
        return (bool) $this->where('ip_address', $ip)->first();
---
SELECT *
FROM `ip_whitelist`
WHERE `ip_address` = '::1'
 LIMIT 1