app/Models/LogBackupModel.php

SELECT *
FROM `log_backups`
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function latest(): ?array
    {
        return $this->orderBy('created_at', 'DESC')->first();