app/Models/NotificationModel.php

    public function getUnread(int $userId, int $limit = 10): array
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0
ORDER BY `created_at` DESC
 LIMIT 5

    public function countUnread(int $userId): int
{
    return $this->where('user_id', $userId)
                ->where('is_read', 0)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 1
AND `is_read` = 0