app/Models/PengajuanModel.php

    public function getWithRelations(int $id): ?array
    {
        $p = $this->select('pengajuan.*, users.nama_lengkap as advokat_nama, users.nia as advokat_nia, users.gelar as advokat_gelar, pbh_cabang.nama as cabang_nama, pbh_cabang.kode as cabang_kode')
                  ->join('users', 'users.id = pengajuan.user_id')
                  ->join('pbh_cabang', 'pbh_cabang.id = pengajuan.pbh_cabang_id')
                  ->where('pengajuan.id', $id)
                  ->first();
        if (!$p) return null;

        $p['penerima_manfaat'] = model('PenerimaManfaatModel')->where('pengajuan_id', $id)->findAll();
---
SELECT `pengajuan`.*, `users`.`nama_lengkap` as `advokat_nama`, `users`.`nia` as `advokat_nia`, `users`.`gelar` as `advokat_gelar`, `pbh_cabang`.`nama` as `cabang_nama`, `pbh_cabang`.`kode` as `cabang_kode`
FROM `pengajuan`
JOIN `users` ON `users`.`id` = `pengajuan`.`user_id`
JOIN `pbh_cabang` ON `pbh_cabang`.`id` = `pengajuan`.`pbh_cabang_id`
WHERE `pengajuan`.`id` = 37
AND `pengajuan`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `penerima_manfaat`
WHERE `pengajuan_id` = 37