app/Models/VerificationFeedbackModel.php

    public function getByPengajuan(int $pengajuanId): array
{
    return $this->select('verification_feedbacks.*, users.nama_lengkap as admin_nama')
                ->join('users', 'users.id = verification_feedbacks.admin_id', 'left')
                ->where('pengajuan_id', $pengajuanId)
                ->orderBy('created_at', 'DESC')
                ->findAll();
---
SELECT `verification_feedbacks`.*, `users`.`nama_lengkap` as `admin_nama`
FROM `verification_feedbacks`
LEFT JOIN `users` ON `users`.`id` = `verification_feedbacks`.`admin_id`
WHERE `pengajuan_id` = 37
ORDER BY `created_at` DESC