app/Libraries/ActivityLogger.php

INSERT INTO `activity_logs` (`user_id`, `user_role`, `action`, `module`, `description`, `subject_type`, `subject_id`, `old_values`, `new_values`, `ip_address`, `user_agent`, `created_at`) VALUES ('1', 'super_admin', 'login_success', 'auth', 'Login berhasil: superadmin@peradi.or.id', NULL, NULL, NULL, NULL, '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:157.0) Gecko/20100101 Firefox/157.0', '2026-10-06 16:48:24')
---
    public static function log(
        string $action,
        string $module,
        string $description = '',
        array $options = []
    ): void {
        try {
            $request = service('request');
            $model = new ActivityLogModel();
            $model->insert([
                'user_id'      => session()->get('user_id'),
                'user_role'    => session()->get('role'),
                'action'       => $action,
                'module'       => $module,
                'description'  => $description,
                'subject_type' => $options['subject_type'] ?? null,
                'subject_id'   => $options['subject_id'] ?? null,
                'old_values'   => isset($options['old']) ? json_encode($options['old'], JSON_UNESCAPED_UNICODE) : null,
                'new_values'   => isset($options['new']) ? json_encode($options['new'], JSON_UNESCAPED_UNICODE) : null,
                'ip_address'   => $request->getIPAddress(),
                'user_agent'   => substr((string) $request->getUserAgent(), 0, 255),
            ]);