app/Libraries/LogArchiver.php

SELECT *
FROM `activity_logs`
ORDER BY `created_at` ASC
 LIMIT 1
---
    public static function stats(): array
    {
        $logModel = new ActivityLogModel();
        $archiveModel = new ActivityLogArchiveModel();

        return [
            'total_active' => $logModel->countAll(),
            'total_archive' => $archiveModel->countAll(),
            'oldest_active' => $logModel->orderBy('created_at', 'ASC')->first()['created_at'] ?? null,